In [1]:
# import Library yang dibutuhkan
import pandas as pd                   #dataframe manipulation
import numpy as np                    #scientific camputing
import seaborn as sns                 #visualization
import matplotlib.pyplot as plt       #visualization
%matplotlib inline
sns.set(color_codes=True)

import warnings
warnings.filterwarnings('ignore')


# Tables yang akan digunakan
'''
name.basics.tsv.gz
title.basics.tsv.gz
title.crew.tsv.gz
title.episode.tsv.gz
title.ratings.tsv.gz
'''

# Load all the TSV file into a DataFrame
df = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/name.basics.tsv", sep='\t', na_values="\\N") #formatting penulisan NaN
#title_basics = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.basics.tsv", sep='\t')
#title_crew = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.crew.tsv", sep='\t')
#title_episode = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.episode.tsv", sep='\t')
#title_ratings = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.ratings.tsv", sep='\t')

# Display the first 5 rows
df.head()
#title_basics.head()
#title_crew.head()
#title_episode.head()
#title_ratings.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899.0,1987.0,"actor,miscellaneous,producer","tt0050419,tt0072308,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934.0,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949.0,1982.0,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0069467,tt0050976,tt0083922"

In [3]:
'''Data Wrangling'''

# Cek tipe data
df.dtypes

nconst                object
primaryName           object
birthYear            float64
deathYear            float64
primaryProfession     object
knownForTitles        object
dtype: object

In [5]:
# Hapus kolom yang tidak digunakan
df = df.drop(['birthYear', 'deathYear', 'primaryProfession', 'knownForTitles'], axis=1)

In [7]:
df.head()

      nconst      primaryName
0  nm0000001     Fred Astaire
1  nm0000002    Lauren Bacall
2  nm0000003  Brigitte Bardot
3  nm0000004     John Belushi
4  nm0000005   Ingmar Bergman

In [9]:
# Rename kolom
df = df.rename(columns = {"nconst" : "nameID", 
                          "primaryName" : "name"})

df.head()

      nameID             name
0  nm0000001     Fred Astaire
1  nm0000002    Lauren Bacall
2  nm0000003  Brigitte Bardot
3  nm0000004     John Belushi
4  nm0000005   Ingmar Bergman

In [11]:
# Cek duplicates
df.shape

(13990490, 2)

In [13]:
# Menunjukkan Duplicates
df[df.duplicated()]

Empty DataFrame
Columns: [nameID, name]
Index: []

In [ ]:
'''known from above there's no duplicates'''

# Menghitung jumlah baris tiap kolom
#df.count()

# Membuang baris duplikat
#df.drop_duplicates()

In [15]:
# Cek Missing Values
print(df.isnull().sum())

nameID     0
name      59
dtype: int64

In [17]:
'''Ternyata ada missing value di nama, kita akan hapus'''

df = df.dropna()
df.count()

nameID    13990431
name      13990431
dtype: int64

In [ ]:
# Cek outlier dg boxplot
#sns.boxplot(x=df['Nama kolom'])

'''karena ini object, bukan numerical, maka skip bagian ini'''

In [ ]:
# Mengelim outlier dengan IQR
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)
IQR = Q3 - Q1
print(IQR)

In [ ]:
# Filter dataframe tanpa outlier
df = df[~((df < (Q1 - 1.5 * IQR)) | (df > (Q3 + 1.5 * IQR) )). any(axis=1)]
df.shape

In [ ]:
'''Exploratory by Visualization'''

'''skip juga karena bukan numerical'''

In [ ]:
'''Export Dataframe'''

# Export into CSV
df.to_csv("C:/Users/HP/Desktop/Data IMDb/name.basics.csv", index=False)